In [1]:
import pandas as pd
df = pd.DataFrame({
    "Name" :['ayush' , 'sita' , 'ravi'],
    "Nationality" : ["nepal" , "srilanka" , "japan"],
    "Sex":["Male", "female" , "male"],
    "Age" :[17 , 18 , 19],
    "Handed":["right" , "left" , "right"]
})

In [2]:
df

    Name Nationality     Sex  Age Handed
0  ayush       nepal    Male   17  right
1   sita    srilanka  female   18   left
2   ravi       japan    male   19  right

In [7]:
pd.crosstab(df.Sex ,df.Handed , margins = True)

Handed  left  right  All
Sex
Male       0      1    1
female     1      0    1
male       0      1    1
All        1      2    3